scereal = read.csv('UScereal.csv')

# 칼로리 VS 단백질

# 기본 그래프 산점도
plot(scereal$calories, scereal$protein, main = '칼로리 vs 단백질')

# 선형선 그리기
model = lm(scereal$protein ~ scereal$calories)
abline(model, col = 'red')
# (종속변수) ~ (독립변수)
# 독립변수(칼로리)가 변할 때 종속변수(단백질)가 어떻게 변화하는지 나타냄. 
# 그래서 공식을 쓸 때 순서가 중요
# 칼로리가 높을수록 단백질 함량도 높아지는가?
# lm(선형회귀) : 두 변수 사이의 관계를 '직선'으로 설명하는 분석 방법

# 모델 요약하기
print(summary(model))

# p-Value : 5.071e-11 => 0.00000000005071을 의미
# p-value(유의확률, 별5개!!!!) : 1700년도 영국에서 개념 도입 -> 
# 1900년대에 공식적으로 도입.
# 과학, 의학, 사회과학 등 다양한 분야에서 유효하게 사용
# 유의확률은 통계 분석에서 '관계가 우연히 나타날 확률'을 의미
# 즉, 칼로리와 단백질 사이에 실제로 아무런 관계가 없는데도, 
# 우연히 지금처럼 강한 관계가 관찰될 확률을 나타냄
# p-value가 0.05보다 작거나 같으면 '칼로리와 단백질 사이에 통계적으로 의미 있는 
# '관계가 있다'고 볼 수 있다.
# 매우 강하게, 우연이 아니라 실제로 강한 관계이다 라고 결론을 내릴 수 있음.
