# 건강검진 최종 10 문제
# library(dplyr)

data = read.csv('국민건강보험공단_건강검진정보.csv', 
                  fileEncoding = 'CP949', 
                  encoding = 'UTF-8', 
                  check.names = FALSE)
# View(data)
# str(data)
# 문제 1. : 남성의 허리둘레 사분위수 조회.
문제1 = data %>% filter(성별==1) %>% select(허리둘레)
# print(quantile(문제1$허리둘레))

# 문제 2. : 성별 허리둘레와 체중 상관관계 조회.
문제2 = data %>% group_by(성별) %>% summarize(상관계수 = cor(허리둘레, `체중(5kg단위)`, use = 'complete.obs'))
# print(문제2)
# 문제 3. : 혈색소 수치는 남성은 13~17, 여성은 12~16이 정상입니다. 정상과 의심을 구별할 수 있는 컬럼 혈색소결과를 만드시오.
# 문제3 = data %>% mutate(혈색소결과=ifelse(성별==1, ifelse(혈색소>=13 & 혈색소<=17, '정상', '의심'),ifelse(성별==2, ifelse(혈색소>=12 & 혈색소<=16, '정상', '의심'))))
# View(문제3)     -안 됨.. 무엇이 잘못되었을까?

# 문제 4. : 식전혈당이 126이상은 위험, 100미만은 정상 그외는 주의를 나타내는 컬럼 당뇨병위험을 추가하시오.
# 결과4 = data %>% mutate(당뇨병위험 = ifelse(`식전혈당(공복혈당)`>=126, '위험', ifelse(`식전혈당(공복혈당)`<100, '정상','주의')))
# View(결과4)
# 추가 후 당뇨병위험 별 인원 수 조회.
당뇨병위험_인원수 = 결과4 %>% group_by(당뇨병위험) %>% summarize(인원수 = n())
# print(당뇨병위험_인원수)
# 문제 5. : 연령대 코드가 5~8인 사람 중 혈색소의 중앙값, 하위 30%, 상위 10%, 표준편차 조회.
문제5 = data %>% filter(data$`연령대코드(5세단위)`>=5 & data$`연령대코드(5세단위)`<=8) %>% 
  summarize(중앙값 = median(혈색소), q30 = quantile(data$혈색소, 0.3), q10 = quantile(data$혈색소, 0.1), sd(data$혈색소))
print(문제5)

# 문제 6. : 음주와 흡연을하는 남성의 혈색소 이상치를 제거한 데이터 수 조회. 임계치는 2로 필터링
health = data %>% filter(data$흡연상태==1 & data$음주여부==1, use = 'complete.obs')
print(health)
mu = mean(health)
print(mu)
# sigma = sd(health)
이상치_제거_데이터 = health
# 문제 7. : 연령대 코드별로 허리둘레의 분포를 박스플롯으로 나타내세요.
허리둘레_박스플롯 = boxplot(group_by(data$`연령대코드(5세단위)`) %>% main = '연령대별 허리둘레 분포', xlab = data$`연령대코드(5세단위)`, ylab = data$허리둘레, col=c('blue', 'red', 'orenge'))

# 문제 8. : 연령대 코드가 5~8인 사람의 신장과 체중의 관계를 산점도로 나타내시오. 회귀선도 추가하시오.
# 문제 9. : 감마지티피의 분포를 정규분포그래프으로 나타내세요. 중앙값, 하위 20%, 상위 20%, 신뢰구간도 표현해주세요.
# 문제 10. : 혈청지오티와 혈청지피티의 관계를 산점도로 나타내시오. 단, 혈청지오티와 혈청지피티를 min-max로 스케일링 후 비교하시오. 회귀선도 추가하시오.
